Tekla Open API Reference for Tekla Structures 2025
ClashCheckHandler.RunClashCheckWithOptions Method
Overload List
Name | Description
RunClashCheckWithOptions(Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
RunClashCheckWithOptions(Boolean, Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
Top
See Also
Reference
ClashCheckHandler Class
Tekla.Structures.Model Namespace